In [1]:
"""
import json
import pandas as pd
import src.trainer.metrics as metrics

metrics=metrics.Metrics()
for mode in ['dev_nlq','dev_schema' ,'dev_nlq_schema']:
# for mode in ['dev_nlq_schema', 'dev_nlq']:
    # mode = "dev_schema"
    # results_path = f"./data/{mode}/{mode}_result_debugged_by_ref_dvqs.json"
    results_path = f"./nvBench-Rob/{mode}/{mode}_result_debugged_by_db_ann_no_ref.json"
    # results_path = f"./data/{mode}/{mode}_result_debugged_by_db_ann.json"
    # results_path = f"./data/{mode}/{mode}_result_nlq_rag.json"




    cmp = pd.read_json(results_path)
    # preds_ref_dvqs = cmp['predict_debugged_ref_dvqs'].to_list()
    preds_db_ann = cmp['predict_debugged_db_ann'].to_list()
    preds_rag_nlq = cmp['predict_rag_nlq'].to_list()
    tgts = cmp['target'].to_list()


    

    print(f"------------------------------------------{mode}---------------------------------------------------------")
    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_rag_nlq, tgts, sql_type="vql")
    acc_com = (acc_vis + acc_axis + acc_data) / 3
    print("RAG_NLQ:")
    print("data len: ", len(preds_rag_nlq))
    print("Acc.: {:.2f}%".format(acc_tree*100))
    print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    
    print()

    # acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_ref_dvqs, tgts, sql_type="vql")
    # acc_com = (acc_vis + acc_axis + acc_data) / 3
    # print("RAG_DVQ:")
    # print("data len: ", len(preds_ref_dvqs))
    # print("Acc.: {:.2f}%".format(acc_tree*100))
    # print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    # print()

    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_db_ann, tgts, sql_type="vql")
    acc_com = (acc_vis + acc_axis + acc_data) / 3
    print("DB_Ann:")
    print("data len: ", len(preds_db_ann))
    print("Acc.: {:.2f}%".format(acc_tree*100))
    print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    print()
"""

'\nimport json\nimport pandas as pd\nimport src.trainer.metrics as metrics\n\nmetrics=metrics.Metrics()\nfor mode in [\'dev_nlq\',\'dev_schema\' ,\'dev_nlq_schema\']:\n# for mode in [\'dev_nlq_schema\', \'dev_nlq\']:\n    # mode = "dev_schema"\n    # results_path = f"./data/{mode}/{mode}_result_debugged_by_ref_dvqs.json"\n    results_path = f"./nvBench-Rob/{mode}/{mode}_result_debugged_by_db_ann_no_ref.json"\n    # results_path = f"./data/{mode}/{mode}_result_debugged_by_db_ann.json"\n    # results_path = f"./data/{mode}/{mode}_result_nlq_rag.json"\n\n\n\n\n    cmp = pd.read_json(results_path)\n    # preds_ref_dvqs = cmp[\'predict_debugged_ref_dvqs\'].to_list()\n    preds_db_ann = cmp[\'predict_debugged_db_ann\'].to_list()\n    preds_rag_nlq = cmp[\'predict_rag_nlq\'].to_list()\n    tgts = cmp[\'target\'].to_list()\n\n\n\n\n    print(f"------------------------------------------{mode}---------------------------------------------------------")\n    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_rag_nlq, tgts, sql_type="vql")\n    acc_com = (acc_vis + acc_axis + acc_data) / 3\n    print("RAG_NLQ:")\n    print("data len: ", len(preds_rag_nlq))\n    print("Acc.: {:.2f}%".format(acc_tree*100))\n    print(\'acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}\'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))\n\n    print()\n\n    # acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_ref_dvqs, tgts, sql_type="vql")\n    # acc_com = (acc_vis + acc_axis + acc_data) / 3\n    # print("RAG_DVQ:")\n    # print("data len: ", len(preds_ref_dvqs))\n    # print("Acc.: {:.2f}%".format(acc_tree*100))\n    # print(\'acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}\'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))\n    # print()\n\n    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_db_ann, tgts, sql_type="vql")\n    acc_com = (acc_vis + acc_axis + acc_data) / 3\n    print("DB_Ann:")\n    print("data len: ", len(preds_db_ann))\n    print("Acc.: {:.2f}%".format(acc_tree*100))\n    print(\'acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}\'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))\n    print()\n'

In [2]:
# import json
# import pandas as pd
# import src.trainer.metrics as metrics

# metrics=metrics.Metrics()
# for mode in ['dev_nlq','dev_schema' ,'dev_nlq_schema']:
# # for mode in ['dev_nlq_schema']:
#     # mode = "dev_schema"
#     # results_path = f"./data/{mode}/{mode}_result_debugged_by_ref_dvqs.json"
#     # results_path = f"./data/{mode}/{mode}_result_debugged_by_db_ann_no_ref.json"
#     results_path = f"./nvBench-Rob/{mode}/{mode}_result_debugged_by_db_ann.json"
#     # results_path = f"./data/{mode}/{mode}_result_nlq_rag.json"




#     cmp = pd.read_json(results_path)
#     preds_ref_dvqs = cmp['predict_debugged_ref_dvqs'].to_list()
#     preds_db_ann = cmp['predict_debugged_db_ann'].to_list()
#     preds_rag_nlq = cmp['predict_rag_nlq'].to_list()
#     tgts = cmp['target'].to_list()


    

#     print(f"------------------------------------------{mode}---------------------------------------------------------")
#     acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_rag_nlq, tgts, sql_type="vql")
#     acc_com = (acc_vis + acc_axis + acc_data) / 3
#     print("RAG_NLQ:")
#     print("data len: ", len(preds_rag_nlq))
#     print("Acc.: {:.2f}%".format(acc_tree*100))
#     print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    
#     print()

#     acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_ref_dvqs, tgts, sql_type="vql")
#     acc_com = (acc_vis + acc_axis + acc_data) / 3
#     print("RAG_DVQ:")
#     print("data len: ", len(preds_ref_dvqs))
#     print("Acc.: {:.2f}%".format(acc_tree*100))
#     print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
#     print()

#     acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_db_ann, tgts, sql_type="vql")
#     acc_com = (acc_vis + acc_axis + acc_data) / 3
#     print("DB_Ann:")
#     print("data len: ", len(preds_db_ann))
#     print("Acc.: {:.2f}%".format(acc_tree*100))
#     print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
#     print()

In [2]:
import json
import pandas as pd
import src.trainer.metrics as metrics

metrics=metrics.Metrics()
# for mode in ['dev_nlq','dev_schema' ,'dev_nlq_schema']:
for mode in ['dev_nlq_schema']:
    # mode = "dev_schema"
    results_path = f"./nvBench-Rob/{mode}/{mode}_result_debugged_by_db_ann.json"
    # results_path = f"./data/{mode}/{mode}_result_debugged_by_db_ann_no_ref.json"
    # results_path = f"./data/{mode}/{mode}_result_nlq_rag.json"




    cmp = pd.read_json(results_path)
    preds_ref_dvqs = cmp['predict_debugged_ref_dvqs'].to_list()
    preds_db_ann = cmp['predict_debugged_db_ann'].to_list()
    preds_rag_nlq = cmp['predict_rag_nlq'].to_list()
    tgts = cmp['target'].to_list()


    

    print(f"------------------------------------------{mode}---------------------------------------------------------")
    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_rag_nlq, tgts, sql_type="vql")
    acc_com = (acc_vis + acc_axis + acc_data) / 3
    print("RAG_NLQ:")
    print("data len: ", len(preds_rag_nlq))
    print("Acc.: {:.2f}%".format(acc_tree*100))
    print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    
    print()

    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_ref_dvqs, tgts, sql_type="vql")
    acc_com = (acc_vis + acc_axis + acc_data) / 3
    print("RAG_DVQ:")
    print("data len: ", len(preds_ref_dvqs))
    print("Acc.: {:.2f}%".format(acc_tree*100))
    print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    print()

    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(preds_db_ann, tgts, sql_type="vql")
    acc_com = (acc_vis + acc_axis + acc_data) / 3
    print("DB_Ann:")
    print("data len: ", len(preds_db_ann))
    print("Acc.: {:.2f}%".format(acc_tree*100))
    print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))
    print()

------------------------------------------dev_nlq_schema---------------------------------------------------------
RAG_NLQ:
data len:  1185
Acc.: 36.46%
acc_tree: 0.3646, acc_vis: 0.9806, acc_axis: 0.5671, acc_data: 0.4456, acc_com: 0.6644

RAG_DVQ:
data len:  1185
Acc.: 38.57%
acc_tree: 0.3857, acc_vis: 0.9814, acc_axis: 0.5857, acc_data: 0.4658, acc_com: 0.6776

DB_Ann:
data len:  1185
Acc.: 54.85%
acc_tree: 0.5485, acc_vis: 0.9814, acc_axis: 0.8152, acc_data: 0.5848, acc_com: 0.7938

In [1]:
import json
import pandas as pd
import src.trainer.metrics as metrics

metrics=metrics.Metrics()
# for mode in ['dev_nlq','dev_schema' ,'dev_nlq_schema']:
for mode in ['dev_nlq_schema']:
    # mode = "dev_schema"
    # results_path = f"./data/{mode}/{mode}_result_debugged_by_ref_dvqs.json"
    # results_path = f"./data/{mode}/{mode}_result_debugged_by_db_ann_no_ref.json"
    results_path = f"./nvBench-Rob/{mode}/result_multi-turn/{mode}_result_multi-turn_gpt4o.json"
    # results_path = f"./data/{mode}/{mode}_result_nlq_rag.json"



    cmp = pd.read_json(results_path)
    final_dvq = cmp['final_dvq'].to_list()
    predict_debugged_db_ann = cmp['predict_debugged_db_ann'].to_list()
    tgts = cmp['target'].to_list()

    print(f"------------------------------------------{mode}---------------------------------------------------------")
    acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(predict_debugged_db_ann, tgts, final_dvq, sql_type="vql")
    # exit()
    # acc_com = (acc_vis + acc_axis + acc_data) / 3
    # print("predict_debugged_db_ann:")
    # print("data len: ", len(predict_debugged_db_ann))
    # print("Acc.: {:.2f}%".format(acc_tree*100))
    # print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))

    # print("*"*100)

    # acc_tree, acc_vis, acc_axis, acc_data = metrics.accuracy(final_dvq, tgts, sql_type="vql")
    # acc_com = (acc_vis + acc_axis + acc_data) / 3
    # print("final_dvq:")
    # print("data len: ", len(final_dvq))
    # print("Acc.: {:.2f}%".format(acc_tree*100))
    # print('acc_tree: {:.4f}, acc_vis: {:.4f}, acc_axis: {:.4f}, acc_data: {:.4f}, acc_com: {:.4f}'.format(acc_tree, acc_vis, acc_axis, acc_data, acc_com))

------------------------------------------dev_nlq_schema---------------------------------------------------------
Visualize BAR SELECT name , identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY T1.identification ASC
Visualize BAR SELECT name , identification FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY identification ASC
Visualize BAR SELECT name , identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification GROUP BY T1.identification HAVING COUNT(DISTINCT T2.browser_identification) >= 2 ORDER BY T1.identification ASC
--------------------------------------------------
Visualize BAR SELECT name , identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY name ASC
Visualize BAR SELECT name , identification FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY identification ASC
Visualize BAR SELECT name, identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification GROUP BY name HAVING COUNT(DISTINCT browser_identification) >= 2 ORDER BY identification ASC
--------------------------------------------------
Visualize BAR SELECT name , identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY T1.identification ASC
Visualize BAR SELECT name , identification FROM web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification ORDER BY identification ASC
Visualize BAR SELECT name , identification FROM Web_client_accelerator AS T1 JOIN accelerator_compatible_browser AS T2 ON T2.accelerator_identification = T1.identification GROUP BY T1.identification HAVING COUNT(DISTINCT T2.browser_identification) >= 2 ORDER BY T1.identification ASC
--------------------------------------------------
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT IS NOT NULL OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40  ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire, COUNT(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40 GROUP BY date_of_hire ORDER BY date_of_hire DESC**

This query accurately reflects the requirements of including employees with a wage between 8000 and 12000 with a non-null commission, as well as those not belonging to department number 40, and it groups the results by hire date.
--------------------------------------------------
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40  ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire, SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND (COMMISSION_PCT != "null" OR Dept_ID != 40) GROUP BY date_of_hire ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40  ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != 'null' OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT IS NOT NULL OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY WEEKDAY
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40  ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire, SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND (COMMISSION_PCT != "null" OR Dept_ID != 40) GROUP BY date_of_hire ORDER BY SUM(employee_id) DESC
--------------------------------------------------
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40 ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire , SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND COMMISSION_PCT != "null" OR Dept_ID != 40  ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
Visualize BAR SELECT date_of_hire, SUM(employee_id) FROM employees WHERE wage BETWEEN 8000 AND 12000 AND (COMMISSION_PCT != "null" OR Dept_ID != 40) GROUP BY date_of_hire ORDER BY SUM(employee_id) DESC BIN date_of_hire BY MONTH
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_Home
Visualize SCATTER SELECT teamID , percentage_of_all_games FROM basketball_match GROUP BY ACC_home
Visualize SCATTER SELECT teamID, percentage_of_all_games FROM basketball_match GROUP BY ACC_Home
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Directed_by , COUNT(*) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
Visualize BAR SELECT Directed_by , COUNT(*) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
--------------------------------------------------
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY COUNT(Directed_by) ASC
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
11111111111111111111111111111111111111111111111111
--------------------------------------------------
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
Visualize BAR SELECT Directed_by , COUNT(Directed_by) FROM film GROUP BY Directed_by ORDER BY Directed_by ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY COUNT(Package_Option) DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY COUNT(Package_Option) DESC
--------------------------------------------------
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT Network FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT Network FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
--------------------------------------------------
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY COUNT(Package_Option) DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY COUNT(Package_Option) DESC
--------------------------------------------------
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN (SELECT channel FROM cartoon WHERE directed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
Visualize BAR SELECT Package_Option , COUNT(Package_Option) FROM TV_Channel WHERE id NOT IN(SELECT id FROM Cartoon WHERE helmed_by = 'Ben Jones') GROUP BY Package_Option ORDER BY Package_Option DESC
--------------------------------------------------
Visualize BAR SELECT Date_in_Locaton_To , COUNT(Date_in_Locaton_To) FROM Document_Locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC BIN Date_in_Locaton_To BY WEEKDAY
Visualize BAR SELECT Date_in_Locaton_To , COUNT(Date_in_Locaton_To) FROM Document_locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC BIN Date_in_Locaton_To BY WEEKDAY
Visualize BAR SELECT Date_in_Locaton_To , COUNT(Date_in_Locaton_To) FROM Document_Locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC BIN Date_in_Locaton_To BY WEEKDAY
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Date_in_Locaton_To , COUNT(Date_in_Locaton_To) FROM Document_Locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC BIN Date_in_Locaton_To BY WEEKDAY
Visualize BAR SELECT Date_in_Locaton_To , COUNT(Date_in_Locaton_To) FROM Document_locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC BIN Date_in_Locaton_To BY WEEKDAY
Visualize BAR SELECT Date_in_Locaton_To, COUNT(Date_in_Locaton_To) FROM Document_Locations GROUP BY LocationCode ORDER BY COUNT(Date_in_Locaton_To) ASC
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY Level ASC
Visualize BAR SELECT Level , count(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY count(*) ASC
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY Level ASC
--------------------------------------------------
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
Visualize BAR SELECT Level , count(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY count(*) ASC
Visualize BAR SELECT Level, COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY Level ASC
Visualize BAR SELECT Level , count(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY count(*) ASC
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY Level ASC
--------------------------------------------------
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
Visualize BAR SELECT Level , count(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY count(*) ASC
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
Visualize BAR SELECT Level , count(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY count(*) ASC
Visualize BAR SELECT Level , COUNT(*) FROM captain WHERE Years < 50 GROUP BY Level ORDER BY COUNT(*) ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize PIE SELECT Carrier , COUNT(*) FROM phone GROUP BY Carrier
Visualize PIE SELECT Carrier , COUNT(*) FROM phone GROUP BY Carrier
Visualize PIE SELECT Carrier, COUNT(*) FROM phone GROUP BY Carrier
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Carrier , COUNT(*) FROM phone GROUP BY Carrier
Visualize PIE SELECT Carrier , COUNT(*) FROM phone GROUP BY Carrier
Visualize BAR SELECT Carrier, COUNT(*) FROM phone GROUP BY Carrier
--------------------------------------------------
Visualize BAR SELECT Carrier , COUNT(Carrier) FROM phone GROUP BY Carrier
Visualize PIE SELECT Carrier , COUNT(*) FROM phone GROUP BY Carrier
Visualize BAR SELECT Carrier, SUM(stock_count) AS TotalQuantity FROM phone_market pm JOIN phone p ON pm.PhoneID = p.PhoneID GROUP BY Carrier
--------------------------------------------------
Visualize BAR SELECT Fname , COUNT(*) FROM Faculty AS T1 JOIN Faculty_Participates_in AS T2 ON T1.Fac_ID = T2.Fac_ID GROUP BY T1.Fac_ID ORDER BY Fname ASC
Visualize BAR SELECT Fname , count(*) FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID = T2.facID GROUP BY T1.Fac_ID ORDER BY Fname ASC
Visualize BAR SELECT Fname , COUNT(*) FROM Faculty AS T1 JOIN Faculty_Participates_in AS T2 ON T1.Fac_ID = T2.Fac_ID GROUP BY T1.Fac_ID ORDER BY Fname ASC
--------------------------------------------------
Visualize BAR SELECT Fname , COUNT(*) FROM Faculty AS T1 JOIN Faculty_Participates_in AS T2 ON T1.Fac_ID = T2.Fac_ID GROUP BY T1.Fname ORDER BY COUNT(*) ASC
Visualize BAR SELECT Fname , count(*) FROM Faculty AS T1 JOIN Faculty_participates_in AS T2 ON T1.facID = T2.facID GROUP BY T1.Fac_ID ORDER BY Fname ASC
Visualize BAR SELECT Fname , COUNT(*) FROM Faculty AS T1 JOIN Faculty_Participates_in AS T2 ON T1.Fac_ID = T2.Fac_ID GROUP BY T1.Fname ORDER BY COUNT(*) ASC
--------------------------------------------------
Visualize BAR SELECT Country , COUNT(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , count(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , COUNT(*) FROM singer GROUP BY Country ORDER BY Country ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Country , COUNT(Country) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , count(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country, COUNT(Country) FROM singer GROUP BY Country ORDER BY Country ASC
--------------------------------------------------
Visualize BAR SELECT Country , COUNT(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , count(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , COUNT(*) FROM singer GROUP BY Country ORDER BY Country ASC
11111111111111111111111111111111111111111111111111
22222222222222222222222222222222222222222222222222
--------------------------------------------------
Visualize BAR SELECT Country , COUNT(Country) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country , count(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country, COUNT(*) FROM singer GROUP BY Country ORDER BY COUNT(*) ASC
--------------------------------------------------
Visualize BAR SELECT Country , COUNT(Country) FROM singer GROUP BY Country ORDER BY COUNT(Country) ASC
Visualize BAR SELECT Country , count(*) FROM singer GROUP BY Country ORDER BY Country ASC
Visualize BAR SELECT Country, COUNT(*) FROM singer GROUP BY Country ORDER BY COUNT(*) ASC
--------------------------------------------------